graphql-api/libs/data/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="https://consumerconnectws.tui.transunion.com/" xmlns:data="https://consumerconnectws.tui.transunion.com/data">
    <soapenv:Header/>
    <soapenv:Body>
        <con:IndicativeEnrichment>
            <con:request>
                <data:AccountCode>M2RVc0ZZM0Rwd2FmZA</data:AccountCode>
                <data:AccountName>CC2BraveCredit</data:AccountName>
                <data:AdditionalInputs>
                    <data:Data>
                        <data:Name>CreditReportVersion</data:Name>
                        <data:Value>7.1</data:Value>
                    </data:Data>
                </data:AdditionalInputs>
                <data:RequestKey>BC-faf3780c-d71d-42c2-b52e-e213cc7408c7</data:RequestKey>
                <data:ClientKey>23605681-0d18-4c8f-8592-07411ca88627</data:ClientKey>
                <data:Customer>
                    <data:CurrentAddress>
                        <data:AddressLine1>1071 101st</data:AddressLine1>
                        <data:AddressLine2 xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:City>Hollywood</data:City>
                        <data:State>FL</data:State>
                        <data:Zipcode>33025</data:Zipcode>
                    </data:CurrentAddress>
                    <data:DateOfBirth>1957-09-01</data:DateOfBirth>
                    <data:FullName>
                        <data:FirstName>Victor</data:FirstName>
                        <data:LastName>Testv</data:LastName>
                        <data:MiddleName xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:Prefix xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:Suffix xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                    </data:FullName>
                    <data:PreviousAddress>
                        <data:AddressLine1 xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:AddressLine2 xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:City xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:State xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <data:Zipcode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                    </data:PreviousAddress>
                    <data:Ssn>0022</data:Ssn>
                </data:Customer>
                <data:ServiceBundleCode>CC2BraveCreditIndicativeEnrichment</data:ServiceBundleCode>
            </con:request>
        </con:IndicativeEnrichment>
    </soapenv:Body>
</soapenv:Envelope>